In [1]:
import pandas as pd

In [2]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35},
        {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}]

In [3]:
store_items = pd.DataFrame(items, index=['store 1', 'store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [5]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [6]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [7]:
store_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [8]:
store_items['bikes']['store 2']

15

In [9]:
store_items['shirts'] = [15, 2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [10]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [12]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses':4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [13]:
store_items = store_items.append(new_store)
store_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [17]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [21]:
store_items.insert(6, 'chocolates', [8, 5, 0])
store_items

,bikes,glasses,pants,shirts,suits,shoes,chocolates,watches,new_watches
store 1,20,NaN,30,15.0,45.0,8,8,35,NaN
store 2,15,50.0,5,2.0,7.0,5,5,10,10.0
store 3,20,4.0,30,NaN,NaN,0,0,35,35.0

In [22]:
store_items.pop('chocolates')
store_items.pop('new_watches')

store 1     NaN
store 2    10.0
store 3    35.0
Name: new_watches, dtype: float64

In [23]:
store_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30    15.0   45.0      8       35
store 2     15     50.0      5     2.0    7.0      5       10
store 3     20      4.0     30     NaN    NaN      0       35

In [24]:
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

In [25]:
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [28]:
store_items = store_items.drop(['store 2'], axis = 0)
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 3     20      4.0     30     NaN    NaN

In [29]:
store_items = store_items.rename(columns={'bikes': 'hats'})
store_items

         hats  glasses  pants  shirts  suits
store 1    20      NaN     30    15.0   45.0
store 3    20      4.0     30     NaN    NaN

In [30]:
store_items = store_items.rename(index={'store 3': 'last store'})
store_items

            hats  glasses  pants  shirts  suits
store 1       20      NaN     30    15.0   45.0
last store    20      4.0     30     NaN    NaN